### Exercícios
Alunos
* Vitor Versoza da Mata Quintella
* Samya de Lara Pinheiro

Crie um novo banco de dados chamado exercicios (se ele já não existir)

### Loja de Computadores

Execute o código abaixo para criação de tabelas que serão usadas

``` sql
CREATE TABLE Manufacturers (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL
);

CREATE TABLE Products (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL ,
	Price REAL NOT NULL ,
	Manufacturer INTEGER NOT NULL
		CONSTRAINT fk_Manufacturers_Code REFERENCES Manufacturers(Code)
);

INSERT INTO Manufacturers
    (Code,Name)
VALUES
    (1,'Sony'),
    (2,'Creative Labs'),
    (3,'Hewlett-Packard'),
    (4,'Iomega'),
    (5,'Fujitsu'),
    (6,'Winchester');

INSERT INTO
    Products(Code,Name,Price,Manufacturer)
VALUES
    (1,'Hard drive',240,5),
    (2,'Memory',120,6),
    (3,'ZIP drive',150,4),
    (4,'Floppy disk',5,6),
    (5,'Monitor',240,1),
    (6,'DVD drive',180,2),
    (7,'CD drive',90,2),
    (8,'Printer',270,3),
    (9,'Toner cartridge',66,3),
    (10,'DVD burner',180,2);
```

#### Coloque o comando SQL abaixo de cada pergunta aqui no notebook (depois de testar no pgAdmin)

1. Selecione os nomes de todos os produtos da loja.

```sql
select name from products;
```

2. Selecione os nomes e os preços de todos os produtos da loja.

```sql
select name,price from products;
```

3. Selecione o nome dos produtos com preço menor ou igual a 200.

```sql
select name from products where price <= 200;
```

4. Selecione todos os produtos com preço entre $60 e $120.

```sql
select name from products where price between 60 and 120;
```

5. Selecione o nome e o preço em centavos (ou seja, o preço deve ser multiplicado por 100).

```sql
select name,price*100 from products;
```

6. Calcule o preço médio de todos os produtos.

```sql
select avg(price) as media_preco from products;
```

7. Calcule o preço médio de todos os produtos com código de fabricante igual a 2.

```sql
select avg(price) as media_preco from products where manufacturer = 2;
```

8. Calcule o número de produtos com preço maior ou igual a 180.

```sql
select count(*) as num_produtos from products where price >= 180;
```

9. Selecione o nome e o preço de todos os produtos com preço maior ou igual a US180 e classifique primeiro por preço (em ordem decrescente) e depois por nome (em ordem crescente).

```sql
select name,price from products where price >= 180 order by price desc,name;
```

10. Selecione todos os dados dos produtos, incluindo todos os dados do fabricante de cada produto.

```sql
select
    products.*
    ,manufacturers.name as manufacturer_name
from products
inner join manufacturers
on products.manufacturer = manufacturers.code
order by manufacturer, products.name;
```

11.Selecione o nome do produto, preço e nome do fabricante de todos os produtos.

```sql
select
    products.name as product_name
    ,products.price as price
    ,manufacturers.name as manufacturer_name
from products
inner join manufacturers
on products.manufacturer = manufacturers.code
order by manufacturer, products.name;
```

12. Selecione o preço médio dos produtos de cada fabricante, mostrando apenas o código do fabricante.

```sql
select manufacturer, avg(price) from products group by manufacturer;
```

13. Selecione o preço médio dos produtos de cada fabricante, mostrando o nome do fabricante.

```sql
-- opcao 1: Mais limpo
select m.name, avg(p.price) from products p inner join manufacturers m on p.manufacturer = m.code group by m.name;

-- opcao 2: Menos custoso? (testar com explain)
select name,media_preco
from
(select manufacturer, avg(price) as media_preco
from products group by manufacturer )
    as t
inner join manufacturers
    on t.manufacturer = manufacturers.code;
```

14. Selecione os nomes dos fabricantes cujos produtos têm preço médio maior ou igual a 50.


```sql
with cte_media as (
    select m.name, avg(p.price) as media_preco
    from products p
    inner join manufacturers m on p.manufacturer = m.code
    group by m.name
    )
select name from cte_media where media_preco >= 150;
```

15. Selecione o nome e o preço do produto mais barato.

```sql
select name,price from products order by price asc limit 1;

-- opcao 2
with cte_min as (select min(price) as min_price from products)
select name, price from products
inner join cte_min on price = cte_min.min_price;
```

16. Selecione o nome de cada fabricante junto com o nome e o preço de seu produto mais caro.

```sql
-- seleciona considerando a possibilidade de mais de um produto com o maior preço
with cte_max as (select manufacturer,max(price) as max_price from products group by manufacturer)
select manufacturers.name, products.name, price from products
right join  cte_max on price = cte_max.max_price and products.manufacturer = cte_max.manufacturer
inner join manufacturers on manufacturers.code = products.manufacturer
order by manufacturers.name, products.name;
```

17. Selecione o nome de cada fabricante que tenha um preço médio acima de 145 e contenha pelo menos 2 produtos diferentes.

```sql
with cte_media as (
    select m.name, avg(p.price) as media_preco,  count(distinct p.name) as qtd_produtos
    from products p
    inner join manufacturers m on p.manufacturer = m.code
    group by m.name
    )
select name from cte_media where media_preco > 145 and qtd_produtos> 1;
```

18. Adicione um novo produto: Alto-falantes, US 70, fabricante 2.

```sql
insert into products
        (code, name, price, manufacturer)
    values
        ((select MAX(code)+1 from products), 'Alto-falantes', 70, 2);
```

19. Atualize o nome do produto 8 para "Impressora a Laser".

```sql
UPDATE products SET name = 'Impressora a Laser' WHERE code = 8;
```

20. Aplique um desconto de 10% em todos os produtos.

```sql
update products set price = price * (1-0.1);
```

21. Aplique um desconto de 10% em todos os produtos com preço maior ou igual a 120.

```sql
update products set price = price * (1-0.1) where price >= 120;
```

### Gerenciamento de Empregados

![Relacionamento](https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Employees.png/300px-Employees.png)

Crie as tabelas e relacionamentos conforme diagrama acima.

```sql
CREATE TABLE Departaments (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(45) NOT NULL,
	Budget MONEY NOT NULL
);

CREATE TABLE Employees (
    Code INTEGER PRIMARY KEY NOT NULL,
    Name VARCHAR(100) NOT NULL,
    Departament INTEGER NOT NULL,
    CONSTRAINT FK_Departament_Code FOREIGN KEY (Departament) REFERENCES departaments (Code)
);
````

Insira na tabela os valores abaixo

DEPARTMENTS		
CODE	NAME	         BUDGET
    14	IT	             65000
    37	Accounting	     15000
    59	Human Resources	 240000
    77	Research	     55000

Employees
ssn	        name	    lastname	department
123234877	Michael	    Rogers	    14
152934485	Anand	    Manikutty	14
222364883	Carol	    Smith	    37
326587417	Joe	        Stevens	    37
332154719	Mary-Anne	Foster	    14
332569843	George	    O'Donnell	77
546523478	John	    Doe	        59
631231482	David	    Smith	    77
654873219	Zacary	    Efron	    59
745685214	Eric	    Goldsmith	59
845657245	Elizabeth	Doe	        14
845657246	Kumar	    Swamy	    14

```sql
INSERT INTO departaments
    (code, name, budget)
VALUES
       (14, 'IT', 65000),
       (37, 'Accounting', 15000),
       (59, 'Human Resources', 240000),
       (77, 'Research', 55000);


-- Create new column lastname in the table employees
ALTER TABLE employees ADD COLUMN lastname varchar(100);

-- INSERT FOLLOWING DATA INTO THE TABLE employees

INSERT INTO employees
    (code, name, lastname, departament)
VALUES
       (123234877, 'Michael', 'Rogers', 14),
       (152934485, 'Anand', 'Manikutty', 14),
       (222364883, 'Carol', 'Smith', 37),
       (326587417, 'Joe', 'Stevens', 37),
       (332154719, 'Mary-Anne', 'Foster', 14),
       (332569843, 'George', 'O''Donnell', 77),
       (546523478, 'John', 'Doe', 59),
       (631231482, 'David', 'Smith', 77),
       (654873219, 'Zacary', 'Efron', 59),
       (745685214, 'Eric', 'Goldsmith', 59),
       (845657245, 'Elizabeth', 'Doe', 14),
       (845657246, 'Kumar', 'Swamy', 14);
```

1. Selecione o nome e o sobrenome dos funcionários que trabalham para os departamentos com o segundo menor orçamento.

```sql
select name, lastname from employees
where departament in (
    select code
    from departaments
    order by budget limit 1 offset 1
    );
```

2. Adicione um novo departamento chamado "Garantia de Qualidade", com um orçamento de 40.000 e código departamental 11. Adicione um funcionário chamado "Mary Moore" nesse departamento, com SSN 847-21-9811.


```sql
INSERT INTO departaments (code, name, budget)
VALUES (11, 'Garantia de Qualidade', 40000);

INSERT INTO employees (ssn, name, lastname, departament)
VALUES (847219811, 'Mary Moore', 'Garcia', 11);
```

3. Reduzir o orçamento de todos os departamentos em 10%.
```sql
UPDATE departaments SET budget = budget * (1 - 0.1);
```

4. Reatribuir todos os funcionários do departamento de Pesquisa (código 77) para o departamento de TI (código 14).
```sql
UPDATE employees SET departament = 14 WHERE departament = 77;
```

5. Apague da tabela todos os funcionários do departamento de TI (código 14).
```sql
DELETE FROM employees WHERE departament = 14;
```
6. Exclua da tabela todos os funcionários que trabalham em departamentos com orçamento maior ou igual a 60.000.
```sql
DELETE FROM employees
WHERE departament IN (SELECT code FROM departaments WHERE budget >= 60000::money);
```

7. Exclua da tabela todos os funcionários.
```sql
DELETE FROM employees;
```

### Titanic

1 - Utilize o site do Kaggle. Iremos baixar o arquivo CSV do Titanic:https://www.kaggle.com/competitions/titanic/data?select=test.csv

2 - Abaixo o dicionário de dados, que também está no Kaggle. Para este exercício, vamos manter a descrição em inglês 

Variable	Definition	    Key
survival	Survival	    0 = No, 1 = Yes
pclass	    Ticket class	1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex	
Age	        Age in years	
sibsp	    # of siblings / spouses aboard the Titanic	
parch	    # of parents / children aboard the Titanic	
ticket	    Ticket number	
fare	    Passenger fare	
cabin	    Cabin number	
embarked	Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton

3 - O objetivo desta tarefa é:
    a. Criar quatro tabelas: Survival, pclass, embarked e passageiros. Isso por que para as colunas que possuem uma descrição (Key) é necessário criar uma tabela para cada uma delas.

In [4]:
import psycopg2

In [123]:

table_survival = "CREATE TABLE IF NOT EXISTS Survival(Code int primary key, description char(3));"
table_pclass = "CREATE TABLE IF NOT EXISTS pclass(Code int primary key, description char(10));"
table_embarked = "CREATE TABLE IF NOT EXISTS embarked(Code varchar(10) primary key, description varchar(20));"
table_passenger = """CREATE TABLE IF NOT EXISTS passenger
(
    PassengerId int primary key,
    Survived    int,
    Pclass      int,
    Name        varchar(100),
    Sex         char(6),
    Age         float,
    SibSp       int,
    Parch       int,
    Fare      float,
    Cabin       varchar(100),
    Embarked    varchar(10),


    foreign key (Survived) references survival (code),
    foreign key (Pclass) references pclass (code),
    foreign key (Embarked) references embarked (code)
);"""


conn = psycopg2.connect(host='localhost',
                        database='exercicios',
                        user='postgres',
                        password= 'admin')

cur = conn.cursor()

try:
    cur.execute(table_survival)
    conn.commit()
    cur.execute(table_pclass)
    conn.commit()
    cur.execute(table_embarked)
    conn.commit()
    cur.execute(table_passenger)
    conn.commit()
    cur.close()

except (Exception, psycopg2.DatabaseError) as error:
    print(error)
finally:
    if conn is not None:
        conn.close()
        print('Tabelas criadas! Conexão encerrada.')

Tabelas criadas! Conexão encerrada.


    b. Usar o arquivo CSV e carregar os respectivos dados em suas tabelas. A criação das tabelas e a inclusão de registros deverá ser feito pelo python
    c. Nas tabelas survival, pclass e emarked não deverá ter valores duplicados

In [45]:
# Function to commit sql to DB
def commit_query(query):
    conn = psycopg2.connect(host='localhost',
                            database='exercicios',
                            user='postgres',
                            password= 'admin')

    cur = conn.cursor()

    try:
        cur.execute(query)
        conn.commit()
        mobile_records = cur.fetchall()
        cur.close()

    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
    finally:
        if conn is not None:
            conn.close()
        return mobile_records

def dataframe_to_query(df, table):
    cols = ",".join([str(i) for i in df.columns.tolist()])
    sql = f"INSERT INTO {table} ( {cols} )\n VALUES\n"
    last_row = df.shape[0] - 1
    for i,row in df.iterrows():
        sql = sql + str(tuple(row))
        if i is not last_row:
            sql = sql +',\n'
        else:
            sql = sql +';'
    return sql

In [41]:
# Input Survival
table ='survival'
columns = ['code', 'description']
data = [[0,'No'],[1, 'Yes']]
df = pd.DataFrame(data, columns=columns)
query = dataframe_to_query(df, table)
commit_query(query)

# Input Survival
table ='pclass'
columns = ['code', 'description']
data = [[1,'1st class'],[2, '2nd class'],[3, '3rd class']]
df = pd.DataFrame(data, columns=columns)
query = dataframe_to_query(df, table)
commit_query(query)

# Input embarked
table ='embarked'
columns = ['code', 'description']
data = [['C','Cherbourg'],['Q', 'Queenstown'],['S', 'Southampton']]
df = pd.DataFrame(data, columns=columns)
query = dataframe_to_query(df, table)
commit_query(query)

In [4]:
import pandas as pd
import numpy as np
# Read titanic.csv file keep only the columns Survived, Pclass, embarked
df = pd.read_csv('titanic.csv')
df = df.drop(columns='Ticket')
df = df.replace({np.nan: None})

conn = psycopg2.connect(host='localhost',
                        database='exercicios',
                        user='postgres',
                        password= 'admin')
# cursor
cur = conn.cursor()

# list for inserting
cols = ",".join([str(i) for i in df.columns.tolist()])

# insert DataFrame records one by one.
for i,row in df.iterrows():
    sql = "INSERT INTO passenger (" +cols + ") VALUES (" + "%s,"*(len(row)-1) + "%s)"
    cur.execute(sql, tuple(row))
    conn.commit()

cur.close()
conn.close()
print('Tabela Passengers povoada! Conexão encerrada.')

Tabela Passengers povoada! Conexão encerrada.

4- Responder as seguintes perguntas via SQL:
1 - Quantas pessoas sobreviveram do sexo feminino? **resposta = 233**
```sql
SELECT count(passengerid) FROM passenger WHERE survived = 1 AND sex = 'female';

```

2 - Quantas pessoas do sexo masculino não sobreviveram?  **resposta = 468**

```sql
SELECT count(passengerid) FROM passenger WHERE survived = 0 AND sex = 'male';

```

3 - Agrupar em um unico resultado (mas pode ser usado varias queries) quantas pessoas sobreviveram de 0 a 10 anos, sobreviveram de 11 a 20 anos, sobreviveram de 21 a 40 anos e sobreviveram acima de 40 anos. O resultado devera ter duas colunas, o nome do grupo (por ex: Pessoas de 0 a 10 anos) e a contagem

**Resposta:**
contagem, faixa_etaria
62  Pessoas de 0 a 10 anos
163 Pessoas de mais de 40 anos
102 Pessoas de 11 a 20 anos
387 Pessoas de 21 a 40 anos


```sql
SELECT count(age) as Contagem,
    CASE WHEN age >= 0 AND age < 10 THEN 'Pessoas de 0 a 10 anos'
      WHEN age >= 10 AND age < 20 THEN 'Pessoas de 11 a 20 anos'
      WHEN age >= 20 AND age < 40 THEN 'Pessoas de 21 a 40 anos'
      WHEN age >= 40 THEN 'Pessoas de mais de 40 anos'
    END Faixa_Etária
FROM passenger
WHERE age is not NULL
GROUP BY Faixa_etária;
```

5 - [Opcional] criar uma função no python para realizar o select, sendo que receberá como parâmetros o select a ser feito e os parâmetros em caso de filtro.

In [33]:
def custom_select(table, columns_return, filter_list=[]):
    sql = f"Select {', '.join(columns_return)} from {table}"

    if filter_list != []:
        sql += ' WHERE '
        for i,filter in enumerate(filter_list):
            if i != 0:
                sql += ' AND '
            sql += filter
        sql += ';'

    return sql

In [53]:
table = 'passenger'
columns_return = ['name', 'sex', 'age']
filter = ['survived = 1', "sex = 'female'"]
query = custom_select(table, columns_return, filter)
print('query usado:', query)
print('Resultados:')
commit_query(query)

query usado: Select name, sex, age from passenger WHERE survived = 1 AND sex = 'female';
Resultados:

[('Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0),
 ('Heikkinen, Miss. Laina', 'female', 26.0),
 ('Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female', 35.0),
 ('Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', 'female', 27.0),
 ('Nasser, Mrs. Nicholas (Adele Achem)', 'female', 14.0),
 ('Sandstrom, Miss. Marguerite Rut', 'female', 4.0),
 ('Bonnell, Miss. Elizabeth', 'female', 58.0),
 ('Hewlett, Mrs. (Mary D Kingcome) ', 'female', 55.0),
 ('Masselmani, Mrs. Fatima', 'female', None),
 ('McGowan, Miss. Anna "Annie"', 'female', 15.0),
 ('Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)', 'female', 38.0),
 ('O\'Dwyer, Miss. Ellen "Nellie"', 'female', None),
 ('Spencer, Mrs. William Augustus (Marie Eugenie)', 'female', None),
 ('Glynn, Miss. Mary Agatha', 'female', None),
 ('Nicola-Yarred, Miss. Jamila', 'female', 14.0),
 ('Laroche, Miss. Simonne Marie Anne Andree', 'female', 3.0),
 ('Devaney, Miss. Margaret Delia', 'female', 19.0),
 ("O'Driscoll, Miss. Bridget", 'female', None),
 ('Harper, Mrs. Henry Sleeper (Myna Haxtun)', 'female', 49.0),
 ('Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)', 'female', 29.0),
 ('Rugg, Miss. Emily', 'female', 21.0),
 ('West, Miss. Constance Mirium', 'female', 5.0),
 ('Icard, Miss. Amelie', 'female', 38.0),
 ('Nye, Mrs. (Elizabeth Ramell)', 'female', 29.0),
 ('Andersson, Miss. Erna Alexandra', 'female', 17.0),
 ('Dowdell, Miss. Elizabeth', 'female', 30.0),
 ('McDermott, Miss. Brigdet Delia', 'female', None),
 ('Ilett, Miss. Bertha', 'female', 17.0),
 ('Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)', 'female', 33.0),
 ('Fortune, Miss. Mabel Helen', 'female', 23.0),
 ('Doling, Mrs. John T (Ada Julia Bone)', 'female', 34.0),
 ('Salkjelsvik, Miss. Anna Kristine', 'female', 21.0),
 ('Moran, Miss. Bertha', 'female', None),
 ('Webber, Miss. Susan', 'female', 32.5),
 ('Peter, Miss. Anna', 'female', None),
 ('Weisz, Mrs. Leopold (Mathilde Francoise Pede)', 'female', 29.0),
 ('Newsom, Miss. Helen Monypeny', 'female', 19.0),
 ('Nysten, Miss. Anna Sofia', 'female', 22.0),
 ('Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)', 'female', 24.0),
 ('Pears, Mrs. Thomas (Edith Wearne)', 'female', 22.0),
 ('Gilnagh, Miss. Katherine "Katie"', 'female', 16.0),
 ('Watt, Mrs. James (Elizabeth "Bessie" Inglis Milne)', 'female', 40.0),
 ('Chibnall, Mrs. (Edith Martha Bowerman)', 'female', None),
 ('Johnson, Miss. Eleanor Ileen', 'female', 1.0),
 ('Kink-Heilmann, Miss. Luise Gretchen', 'female', 4.0),
 ('O\'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)', 'female', None),
 ('Pinsky, Mrs. (Rosa)', 'female', 32.0),
 ('Andersen-Jensen, Miss. Carla Christine Nielsine', 'female', 19.0),
 ('Brown, Mrs. James Joseph (Margaret Tobin)', 'female', 44.0),
 ('Lurette, Miss. Elise', 'female', 58.0),
 ('Madigan, Miss. Margaret "Maggie"', 'female', None),
 ('Carr, Miss. Helen "Ellen"', 'female', 16.0),
 ('Cameron, Miss. Clear Annie', 'female', 35.0),
 ('Newell, Miss. Madeleine', 'female', 31.0),
 ('Honkanen, Miss. Eliina', 'female', 27.0),
 ('Bazzani, Miss. Albina', 'female', 32.0),
 ('Harris, Mrs. Henry Birkhardt (Irene Wallach)', 'female', 35.0),
 ('Asplund, Miss. Lillian Gertrud', 'female', 5.0),
 ('Collyer, Miss. Marjorie "Lottie"', 'female', 8.0),
 ('Murphy, Miss. Katherine "Kate"', 'female', None),
 ('Hamalainen, Mrs. William (Anna)', 'female', 24.0),
 ('Touma, Mrs. Darwis (Hanne Youssef Razi)', 'female', 29.0),
 ('Thorne, Mrs. Gertrude Maybelle', 'female', None),
 ('Cherry, Miss. Gladys', 'female', 30.0),
 ('Ward, Miss. Anna', 'female', 35.0),
 ('Parrish, Mrs. (Lutie Davis)', 'female', 50.0),
 ('Graham, Mrs. William Thompson (Edith Junkins)', 'female', 58.0),
 ('Bissette, Miss. Amelia', 'female', 35.0),
 ('Mellinger, Mrs. (Elizabeth Anne Maidment)', 'female', 41.0),
 ('Healy, Miss. Hanora "Nora"', 'female', None),
 ('Andrews, Miss. Kornelia Theodosia', 'female', 63.0),
 ('Abbott, Mrs. Stanton (Rosa Hunt)', 'female', 35.0),
 ('Connolly, Miss. Kate', 'female', 22.0),
 ('Barber, Miss. Ellen "Nellie"', 'female', 26.0),
 ('Bishop, Mrs. Dickinson H (Helen Walton)', 'female', 19.0),
 ('Baxter, Mrs. James (Helene DeLaudeniere Chaput)', 'female', 50.0),
 ('Kelly, Miss. Anna Katherine "Annie Kate"', 'female', None),
 ('Keane, Miss. Nora A', 'female', None),
 ('Fleming, Miss. Margaret', 'female', None),
 ('Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)',
  'female',
  17.0),
 ('Francatelli, Miss. Laura Mabel', 'female', 30.0),
 ('Hays, Miss. Margaret Bechstein', 'female', 24.0),
 ('Ryerson, Miss. Emily Borie', 'female', 18.0),
 ('Nilsson, Miss. Helmina Josefina', 'female', 26.0),
 ('Kantor, Mrs. Sinai (Miriam Sternin)', 'female', 24.0),
 ('Wick, Miss. Mary Natalie', 'female', 31.0),
 ('Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)', 'female', 40.0),
 ('Slayter, Miss. Hilda Mary', 'female', 30.0),
 ('Caldwell, Mrs. Albert Francis (Sylvia Mae Harbaugh)', 'female', 22.0),
 ('Young, Miss. Marie Grice', 'female', 36.0),
 ('Ball, Mrs. (Ada E Hall)', 'female', 36.0),
 ('Goldsmith, Mrs. Frank John (Emily Alice Brown)', 'female', 31.0),
 ('Hippach, Miss. Jean Gertrude', 'female', 16.0),
 ('McCoy, Miss. Agnes', 'female', None),
 ('Frauenthal, Mrs. Henry William (Clara Heinsheimer)', 'female', None),
 ('Burns, Miss. Elizabeth Margaret', 'female', 41.0),
 ('Fortune, Miss. Alice Elizabeth', 'female', 24.0),
 ('Brown, Miss. Amelia "Mildred"', 'female', 24.0),
 ('Smith, Miss. Marion Elsie', 'female', 40.0),
 ('Davison, Mrs. Thomas Henry (Mary E Finck)', 'female', None),
 ('Bowerman, Miss. Elsie Edith', 'female', 22.0),
 ('McGovern, Miss. Mary', 'female', None),
 ('Mockler, Miss. Helen Mary "Ellie"', 'female', None),
 ('Warren, Mrs. Frank Manley (Anna Sophia Atkinson)', 'female', 60.0),
 ('Moussa, Mrs. (Mantoura Boulos)', 'female', None),
 ('Jermyn, Miss. Annie', 'female', None),
 ('Aubart, Mme. Leontine Pauline', 'female', 24.0),
 ('Meyer, Mrs. Edgar Joseph (Leila Saks)', 'female', None),
 ('Landergren, Miss. Aurora Adelia', 'female', 22.0),
 ('Bidois, Miss. Rosalie', 'female', 42.0),
 ('Nakid, Miss. Maria ("Mary")', 'female', 1.0),
 ('Holverson, Mrs. Alexander Oskar (Mary Aline Towner)', 'female', 35.0),
 ('Buss, Miss. Kate', 'female', 36.0),
 ('Lehmann, Miss. Bertha', 'female', 17.0),
 ('Newell, Miss. Marjorie', 'female', 23.0),
 ('Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengtsson)', 'female', 24.0),
 ('Trout, Mrs. William H (Jessie L)', 'female', 28.0),
 ('Minahan, Miss. Daisy E', 'female', 33.0),
 ('Drew, Mrs. James Vivian (Lulu Thorne Christian)', 'female', 34.0),
 ('Silven, Miss. Lyyli Karoliina', 'female', 18.0),
 ('Clarke, Mrs. Charles V (Ada Maria Winfield)', 'female', 28.0),
 ('Phillips, Miss. Kate Florence ("Mrs Kate Louise Phillips Marshall")',
  'female',
  19.0),
 ('Thorneycroft, Mrs. Percival (Florence Kate White)', 'female', None),
 ('Louch, Mrs. Charles Alexander (Alice Adelaide Slow)', 'female', 42.0),
 ('Carter, Miss. Lucile Polk', 'female', 14.0),
 ('Richards, Mrs. Sidney (Emily Hocking)', 'female', 24.0),
 ('Hart, Mrs. Benjamin (Esther Ada Bloomfield)', 'female', 45.0),
 ('Reynaldo, Ms. Encarnacion', 'female', 28.0),
 ('Mellinger, Miss. Madeleine Violet', 'female', 13.0),
 ('Baclini, Miss. Marie Catherine', 'female', 5.0),
 ('Kenyon, Mrs. Frederick R (Marion)', 'female', None),
 ('Toomey, Miss. Ellen', 'female', 50.0),
 ('Baclini, Miss. Helene Barbara', 'female', 0.75),
 ('West, Mrs. Edwy Arthur (Ada Mary Worth)', 'female', 33.0),
 ('Jerwan, Mrs. Amin S (Marie Marthe Thuillard)', 'female', 23.0),
 ('Hirvonen, Miss. Hildur E', 'female', 2.0),
 ('Turkula, Mrs. (Hedwig)', 'female', 63.0),
 ('Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)', 'female', 35.0),
 ('Eustis, Miss. Elizabeth Mussey', 'female', 54.0),
 ('Maioni, Miss. Roberta', 'female', 16.0),
 ('Quick, Mrs. Frederick Charles (Jane Richards)', 'female', 33.0),
 ('Rothschild, Mrs. Martin (Elizabeth L. Barrett)', 'female', 54.0),
 ('Lemore, Mrs. (Amelia Milley)', 'female', 34.0),
 ('Angle, Mrs. William A (Florence "Mary" Agnes Hughes)', 'female', 36.0),
 ('Perreault, Miss. Anne', 'female', 30.0),
 ('Hippach, Mrs. Louis Albert (Ida Sophia Fischer)', 'female', 44.0),
 ('Ridsdale, Miss. Lucy', 'female', 50.0),
 ('Quick, Miss. Phyllis May', 'female', 2.0),
 ('Peter, Mrs. Catherine (Catherine Rizk)', 'female', None),
 ('Hart, Miss. Eva Miriam', 'female', 7.0),
 ('LeRoy, Miss. Bertha', 'female', 30.0),
 ('Frolicher, Miss. Hedwig Margaritha', 'female', 22.0),
 ('Crosby, Miss. Harriet R', 'female', 36.0),
 ('Beane, Mrs. Edward (Ethel Clarke)', 'female', 19.0),
 ('Ohman, Miss. Velin', 'female', 22.0),
 ('Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")',
  'female',
  48.0),
 ('Taussig, Mrs. Emil (Tillie Mandelbaum)', 'female', 39.0),
 ('de Messemaeker, Mrs. Guillaume Joseph (Emma)', 'female', 36.0),
 ('Appleton, Mrs. Edward Dale (Charlotte Lamson)', 'female', 53.0),
 ('Kelly, Miss. Mary', 'female', None),
 ('Garside, Miss. Ethel', 'female', 34.0),
 ('Silvey, Mrs. William Baird (Alice Munger)', 'female', 39.0),
 ('Christy, Miss. Julie Rachel', 'female', 25.0),
 ('Thayer, Mrs. John Borland (Marian Longstreth Morris)', 'female', 39.0),
 ('Taussig, Miss. Ruth', 'female', 18.0),
 ('Stephenson, Mrs. Walter Bertram (Martha Eustis)', 'female', 52.0),
 ('Leitch, Miss. Jessie Wills', 'female', None),
 ('Jacobsohn, Mrs. Sidney Samuel (Amy Frances Christy)', 'female', 24.0),
 ('Laroche, Mrs. Joseph (Juliette Marie Louise Lafargue)', 'female', 22.0),
 ('Shutes, Miss. Elizabeth W', 'female', 40.0),
 ('Murphy, Miss. Margaret Jane', 'female', None),
 ('Herman, Miss. Alice', 'female', 24.0),
 ('Becker, Miss. Marion Louise', 'female', 4.0),
 ('Longley, Miss. Gretchen Fiske', 'female', 21.0),
 ('Davis, Miss. Mary', 'female', 28.0),
 ('Sagesser, Mlle. Emma', 'female', 24.0),
 ('Baclini, Miss. Eugenie', 'female', 0.75),
 ('Stanley, Miss. Amy Zillah Elsie', 'female', 23.0),
 ('Doling, Miss. Elsie', 'female', 18.0),
 ('O\'Leary, Miss. Hanora "Norah"', 'female', None),
 ('Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)', 'female', None),
 ('Brown, Mrs. Thomas William Solomon (Elizabeth Catherine Ford)',
  'female',
  40.0),
 ('Turja, Miss. Anna Sofia', 'female', 18.0),
 ('Madill, Miss. Georgette Alexandra', 'female', 15.0),
 ('Karun, Miss. Manca', 'female', 4.0),
 ('Mullens, Miss. Katherine "Katie"', 'female', None),
 ('Astor, Mrs. John Jacob (Madeleine Talmadge Force)', 'female', 18.0),
 ('Kelly, Mrs. Florence "Fannie"', 'female', 45.0),
 ('Cleaver, Miss. Alice', 'female', 22.0),
 ('Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")', 'female', 24.0),
 ('Endres, Miss. Caroline Louise', 'female', 38.0),
 ('Troutt, Miss. Edwina Celia "Winnie"', 'female', 27.0),
 ('Harper, Miss. Annie Jessie "Nina"', 'female', 6.0),
 ('Renouf, Mrs. Peter Henry (Lillian Jefferys)', 'female', 30.0),
 ('Mannion, Miss. Margareth', 'female', None),
 ('Allen, Miss. Elisabeth Walton', 'female', 29.0),
 ('Ryerson, Miss. Susan Parker "Suzette"', 'female', 21.0),
 ('Sinkkonen, Miss. Anna', 'female', 30.0),
 ('Wells, Miss. Joan', 'female', 4.0),
 ('Herman, Mrs. Samuel (Jane Laver)', 'female', 48.0),
 ('Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)', 'female', 33.0),
 ('Carter, Mrs. William Ernest (Lucile Polk)', 'female', 36.0),
 ('Hogeboom, Mrs. John C (Anna Andrews)', 'female', 51.0),
 ('Hocking, Mrs. Elizabeth (Eliza Needs)', 'female', 54.0),
 ('Emanuel, Miss. Virginia Ethel', 'female', 5.0),
 ('Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)', 'female', 43.0),
 ('Ayoub, Miss. Banoura', 'female', 13.0),
 ('Dick, Mrs. Albert Adrian (Vera Gillespie)', 'female', 17.0),
 ('Sjoblom, Miss. Anna Sofia', 'female', 18.0),
 ('Leader, Dr. Alice (Farnham)', 'female', 49.0),
 ('Osman, Mrs. Mara', 'female', 31.0),
 ('Collyer, Mrs. Harvey (Charlotte Annie Tate)', 'female', 31.0),
 ('Chambers, Mrs. Norman Campbell (Bertha Griggs)', 'female', 33.0),
 ('Hays, Mrs. Charles Melville (Clara Jennings Gregg)', 'female', 52.0),
 ('Moor, Mrs. (Beila)', 'female', 27.0),
 ('Stone, Mrs. George Nelson (Martha Evelyn)', 'female', 62.0),
 ('Yasbeck, Mrs. Antoni (Selini Alexander)', 'female', 15.0),
 ('Compton, Miss. Sara Rebecca', 'female', 39.0),
 ('Serepeca, Miss. Augusta', 'female', 30.0),
 ('Goldenberg, Mrs. Samuel L (Edwiga Grabowska)', 'female', None),
 ('Lines, Miss. Mary Conover', 'female', 16.0),
 ('Aks, Mrs. Sam (Leah Rosen)', 'female', 18.0),
 ('Wick, Mrs. George Dennick (Mary Hitchcock)', 'female', 45.0),
 ('Baclini, Mrs. Solomon (Latifa Qurban)', 'female', 24.0),
 ('Swift, Mrs. Frederick Joel (Margaret Welles Barron)', 'female', 48.0),
 ('Bystrom, Mrs. (Karolina)', 'female', 42.0),
 ('Duran y More, Miss. Asuncion', 'female', 27.0),
 ('Beckwith, Mrs. Richard Leonard (Sallie Monypeny)', 'female', 47.0),
 ('Abelson, Mrs. Samuel (Hannah Wizosky)', 'female', 28.0),
 ('Najib, Miss. Adele Kiamie "Jane"', 'female', 15.0),
 ('Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)', 'female', 56.0),
 ('Shelley, Mrs. William (Imanita Parrish Hall)', 'female', 25.0),
 ('Graham, Miss. Margaret Edith', 'female', 19.0)]